#ifndef __OSTIDMANAGER_H__
#define __OSTIDMANAGER_H__
#include "osdefine.h"
#ifdef __cplusplus
extern "C"
{
#endif
typedef struct OsTidManager
{
	unsigned char *tidTable;
	size_t tableSize;
	size_t tableLevel;
	size_t maxTidCount;
} OsTidManager;
/*********************************************************************************************************************
* 初始化tid管理器
* tidManager：tid管理器对象
* return：0:调用成功
*********************************************************************************************************************/
int osTidManagerInit(OsTidManager *tidManager);
/*********************************************************************************************************************
* 释放tid管理器
* tidManager：tid管理器对象
*********************************************************************************************************************/
void osTidManagerUninit(OsTidManager *tidManager);
/*********************************************************************************************************************
* 获得tid
* tidManager：tid管理器对象
* return：获得的tid
*********************************************************************************************************************/
size_t osTidAlloc(OsTidManager *tidManager);
/*********************************************************************************************************************
* 释放tid
* tidManager：tid管理器对象
* tid：要释放的tid
*********************************************************************************************************************/
int osTidFree(OsTidManager *tidManager, size_t tid);
#ifdef __cplusplus
}
#endif
#endif
