#ifndef __SYS_RECURSIVE_MUTEX_H__
#define __SYS_RECURSIVE_MUTEX_H__
#include "sys_semaphore.h"
#ifdef __cplusplus
extern "C"
{
#endif
typedef struct sys_recursive_mutex_t
{
    sys_semaphore_t semaphore;
    int recursive_count;
    void *owner;
    sys_spin_lock_t lock;
} sys_recursive_mutex_t;
/*********************************************************************************************************************
* 静态初始化递归锁
* return：递归锁对象
*********************************************************************************************************************/
#define SYS_RECURSIVE_MUTEX_INIT() \
{ \
.semaphore = SYS_SEMAPHORE_INIT(1, 1), \
.recursive_count = 0, \
.owner = NULL, \
.lock = SYS_SPIN_LOCK_INIT() \
}
/*********************************************************************************************************************
* 静态定义递归锁
* lock：递归锁对象
*********************************************************************************************************************/
#define SYS_RECURSIVE_MUTEX_DEFINE(lock) \
sys_recursive_mutex_t lock = SYS_RECURSIVE_MUTEX_INIT()
/*********************************************************************************************************************
* 初始化递归锁
* lock：递归锁对象
*********************************************************************************************************************/
void sys_recursive_mutex_init(sys_recursive_mutex_t *lock);
/*********************************************************************************************************************
* 获得锁
* lock：递归锁对象
*********************************************************************************************************************/
void sys_recursive_mutex_lock(sys_recursive_mutex_t *lock);
/*********************************************************************************************************************
* 释放锁
* lock：递归锁对象
*********************************************************************************************************************/
void sys_recursive_mutex_unlock(sys_recursive_mutex_t *lock);
#ifdef __cplusplus
}
#endif
#endif