#ifndef __SYS_ATOMIC_H__
#define __SYS_ATOMIC_H__
#include "sys_cfg.h"
typedef struct sys_atomic_t
{
    volatile int value;
} sys_atomic_t;
#ifdef __cplusplus
extern "C"
{
#endif
/*********************************************************************************************************************
* 静态初始化原子变量
* va：原子变量值
* return：原子变量对象
*********************************************************************************************************************/
#define SYS_ATOMIC_INIT(va) \
{ \
.value = va, \
}
/*********************************************************************************************************************
* 存储原子变量
* atomic：原子变量对象
* va：原子变量值
*********************************************************************************************************************/
#define sys_atomic_store(atomic, va) sys_arch_atomic_store(atomic, va)
/*********************************************************************************************************************
* 加载原子变量
* atomic：原子变量对象
* return：原子变量值
*********************************************************************************************************************/
#define sys_atomic_load(atomic) sys_arch_atomic_load(atomic)
/*********************************************************************************************************************
* 替换原子变量值为desired，并返回旧值
* atomic：原子变量对象
* desired：替换值
* return：旧值
*********************************************************************************************************************/
#define sys_atomic_exchange(atomic, desired) sys_arch_atomic_exchange(atomic, desired) 
/*********************************************************************************************************************
* 当原子变量的值等于expected的值时，用desired去替换原子变量的值，并返回1；否则expected的值会被替换为原子变量的值并返回0
* atomic：原子变量对象
* expected：比较值
* desired：替换值
* return：比较结果
*********************************************************************************************************************/
#define sys_atomic_compare_exchange_weak(atomic, expected, desired) sys_arch_atomic_compare_exchange_weak(atomic, expected, desired)
/*********************************************************************************************************************
* 原子变量的值加上va值并返回旧值
* atomic：原子变量对象
* va：改变值
* return：旧值
*********************************************************************************************************************/
#define sys_atomic_fetch_add(atomic, va) sys_arch_atomic_fetch_add(atomic, va)
/*********************************************************************************************************************
* 原子变量的值减去va值并返回旧值
* atomic：原子变量对象
* va：改变值
* return：旧值
*********************************************************************************************************************/
#define sys_atomic_fetch_sub(atomic, va) sys_arch_atomic_fetch_add(atomic, -va)
/*********************************************************************************************************************
* 原子变量的值和va值进行按位与操作并返回旧值
* atomic：原子变量对象
* va：操作值
* return：旧值
*********************************************************************************************************************/
#define sys_atomic_fetch_and(atomic, va) sys_arch_atomic_fetch_and(atomic, va)
/*********************************************************************************************************************
* 原子变量的值和va值进行按位或操作并返回旧值
* atomic：原子变量对象
* va：操作值
* return：旧值
*********************************************************************************************************************/
#define sys_atomic_fetch_or(atomic, va) sys_arch_atomic_fetch_or(atomic, va)
/*********************************************************************************************************************
* 原子变量的值和va值进行按位异或操作并返回旧值
* atomic：原子变量对象
* va：操作值
* return：旧值
*********************************************************************************************************************/
#define sys_atomic_fetch_xor(atomic, va) sys_arch_atomic_fetch_xor(atomic, va)
#ifdef __cplusplus
}
#endif
#endif