#ifndef __OSLIST_H__
#define __OSLIST_H__
#include "osdefine.h"
#ifdef __cplusplus
extern "C"
{
#endif
typedef struct OsListNode
{
	struct OsListNode *preNode;
	struct OsListNode *nextNode;
} OsListNode;

typedef struct OsSingleListNode
{
	struct OsSingleListNode *nextNode;
} OsSingleListNode;
/*********************************************************************************************************************
* 从前面插入节点
* handle 链表头
* node 新节点
*********************************************************************************************************************/
void osInsertToSingleList(OsSingleListNode **handle, OsSingleListNode *node);
/*********************************************************************************************************************
* 从前面删除节点
* handle 链表头
*********************************************************************************************************************/
void osRemoveFromSingleList(OsSingleListNode **handle);
/*********************************************************************************************************************
* 从前面插入节点
* handle 链表头
* node 新节点
*********************************************************************************************************************/
void osInsertToFront(OsListNode **handle, OsListNode *node);
/*********************************************************************************************************************
* 从后面插入节点
* handle 链表头
* node 新节点
*********************************************************************************************************************/
void osInsertToBack(OsListNode **handle, OsListNode *node);
/*********************************************************************************************************************
* 删除一个节点
* handle 链表头
* node 要删除的节点
*********************************************************************************************************************/
void osRemoveFromList(OsListNode **handle, OsListNode *node);
/*********************************************************************************************************************
* 获取一个最后面的节点
* handle 链表头
* return 获取到的节点
*********************************************************************************************************************/
OsListNode *osGetBackFromList(OsListNode **handle);
#ifdef __cplusplus
}
#endif
#endif