#ifndef __SYS_ID_MANAGER_H__
#define __SYS_ID_MANAGER_H__
#include "sys_cfg.h"
#ifdef __cplusplus
extern "C"
{
#endif
typedef struct sys_id_manager_t
{
	unsigned char *id_table;
	int table_size;
	int table_level;
	int max_id_count;
} sys_id_manager_t;
/*********************************************************************************************************************
* 初始化id管理器
* id_manager：id管理器对象
* return：0:调用成功
*********************************************************************************************************************/
int sys_id_manager_init(sys_id_manager_t *id_manager);
/*********************************************************************************************************************
* 释放id管理器
* id_manager：id管理器对象
*********************************************************************************************************************/
void sys_id_manager_uninit(sys_id_manager_t *id_manager);
/*********************************************************************************************************************
* 获得id
* id_manager：id管理器对象
* return：获得的id
*********************************************************************************************************************/
int sys_id_alloc(sys_id_manager_t *id_manager);
/*********************************************************************************************************************
* 释放id
* id_manager：id管理器对象
* id：要释放的id
*********************************************************************************************************************/
void sys_id_free(sys_id_manager_t *id_manager, int id);
#ifdef __cplusplus
}
#endif
#endif
