#ifndef __SYS_LIST_H__
#define __SYS_LIST_H__
#include "sys_cfg.h"
#ifdef __cplusplus
extern "C"
{
#endif
typedef struct sys_list_node_t
{
	struct sys_list_node_t *pre;
	struct sys_list_node_t *next;
} sys_list_node_t;

typedef struct sys_single_list_node_t
{
	struct sys_single_list_node_t *next;
} sys_single_list_node_t;
/*********************************************************************************************************************
* 从前面插入节点
* handle 链表头
* node 新节点
*********************************************************************************************************************/
void sys_insert_to_single_list(sys_single_list_node_t **handle, sys_single_list_node_t *node);
/*********************************************************************************************************************
* 从前面删除节点
* handle 链表头
*********************************************************************************************************************/
void sys_remove_from_single_list(sys_single_list_node_t **handle);
/*********************************************************************************************************************
* 从前面插入节点
* handle 链表头
* node 新节点
*********************************************************************************************************************/
void sys_insert_to_front(sys_list_node_t **handle, sys_list_node_t *node);
/*********************************************************************************************************************
* 从后面插入节点
* handle 链表头
* node 新节点
*********************************************************************************************************************/
void sys_insert_to_back(sys_list_node_t **handle, sys_list_node_t *node);
/*********************************************************************************************************************
* 从中间插入节点
* handle 链表头
* node 新节点
* n 插入位置
*********************************************************************************************************************/
void sys_insert_to_middle(sys_list_node_t **handle, sys_list_node_t *node, int n);
/*********************************************************************************************************************
* 删除一个节点
* handle 链表头
* node 要删除的节点
*********************************************************************************************************************/
void sys_remove_from_list(sys_list_node_t **handle, sys_list_node_t *node);
/*********************************************************************************************************************
* 获取一个最后面的节点
* handle 链表头
* return 获取到的节点
*********************************************************************************************************************/
sys_list_node_t *sys_get_back_from_list(sys_list_node_t **handle);
#ifdef __cplusplus
}
#endif
#endif