#ifndef __SYS_MEM_POOL_H__
#define __SYS_MEM_POOL_H__
#include "sys_cfg.h"
#include "sys_list.h"
#ifdef __cplusplus
extern "C"
{
#endif
typedef struct sys_mem_pool_t
{
	unsigned char *bitmap;                                       //记录页面是否可用
	void *start_address;                                         //内存起始地址
	sys_single_list_node_t *page_list;                            //可用页链表
	long total_page_num;                                       //所有页数量
	long free_page_num;                                        //可用页数量
    long page_size;                                            //页面大小
} sys_mem_pool_t;
/*********************************************************************************************************************
* sys_mem_pool_t初始化
* mem_pool：内存池对象
* start_address：起始内存大小
* size：内存大小
* page_size：页面大小
* return：成功初始化的页面数量
*********************************************************************************************************************/
long sys_mem_pool_init(sys_mem_pool_t *mem_pool, void *start_address, long size, long page_size);
/*********************************************************************************************************************
* 申请页面
* mem_pool：内存池对象
* return：NULL：分配失败：否则返回页面首地址
*********************************************************************************************************************/
void *sys_mem_pool_alloc_page(sys_mem_pool_t *mem_pool);
/*********************************************************************************************************************
* 释放页面
* mem_pool：内存池对象
* page：要释放的页面首地址
* return：0:释放成功;
*********************************************************************************************************************/
int sys_mem_pool_free_page(sys_mem_pool_t *mem_pool, void *page);
/*********************************************************************************************************************
* 获取所有页面数量
* mem_pool：内存池对象
* return：所有页面数量
*********************************************************************************************************************/
long sys_mem_pool_total_page_num(sys_mem_pool_t *mem_pool);
/*********************************************************************************************************************
* 获取可用页面数量
* mem_pool：内存池对象
* return：可用页面数量
*********************************************************************************************************************/
long sys_mem_pool_free_page_num(sys_mem_pool_t *mem_pool);
#ifdef __cplusplus
}
#endif
#endif